smartmeio/arancino-core-mbed/boards.txt
# -----------------------------------
# SmartMe.io Arancino Pico (Picoprobe)
# -----------------------------------
arancinopicopicoprobe.name=SmartMe.io Arancino Pico (Picoprobe)
arancinopicopicoprobe.vid.0=0x2e8a
arancinopicopicoprobe.pid.0=0x0004
arancinopicopicoprobe.vid.1=0x2e8a
arancinopicopicoprobe.pid.1=0x0104
arancinopicopicoprobe.vid.2=0x2e8a
arancinopicopicoprobe.pid.2=0x4004
arancinopicopicoprobe.vid.3=0x2e8a
arancinopicopicoprobe.pid.3=0x4104
arancinopicopicoprobe.vid.4=0x2e8a
arancinopicopicoprobe.pid.4=0x8004
arancinopicopicoprobe.vid.5=0x2e8a
arancinopicopicoprobe.pid.5=0x8104
arancinopicopicoprobe.vid.6=0x2e8a
arancinopicopicoprobe.pid.6=0xc004
arancinopicopicoprobe.vid.7=0x2e8a
arancinopicopicoprobe.pid.7=0xc104
arancinopicopicoprobe.build.usbpid=-DSERIALUSB_PID=0x000a
arancinopicopicoprobe.build.usbpwr=-DUSBD_MAX_POWER_MA=250
arancinopicopicoprobe.build.board=ARANCINO_PICO
arancinopicopicoprobe.build.mcu=cortex-m0plus
arancinopicopicoprobe.build.variant=arancinopico
arancinopicopicoprobe.upload.tool=picoprobe
arancinopicopicoprobe.upload.maximum_size=2097152
arancinopicopicoprobe.upload.maximum_data_size=262144
arancinopicopicoprobe.upload.wait_for_upload_port=true
arancinopicopicoprobe.upload.erase_cmd=
arancinopicopicoprobe.serial.disableDTR=false
arancinopicopicoprobe.serial.disableRTS=false
arancinopicopicoprobe.build.f_cpu=125000000
arancinopicopicoprobe.build.led=
arancinopicopicoprobe.build.core=rp2040
arancinopicopicoprobe.build.ldscript=memmap_default.ld
arancinopicopicoprobe.build.ram_length=256k
arancinopicopicoprobe.build.boot2=boot2_w25q080_2_padded_checksum
arancinopicopicoprobe.build.vid=0x2e8a
arancinopicopicoprobe.build.pid=0x000a
arancinopicopicoprobe.build.usb_manufacturer="SmartMe.io"
arancinopicopicoprobe.build.usb_product="Arancino Pico (Picoprobe)"
arancinopicopicoprobe.menu.flash.2097152_0=2MB (no FS)
arancinopicopicoprobe.menu.flash.2097152_0.upload.maximum_size=2093056
arancinopicopicoprobe.menu.flash.2097152_0.build.flash_length=2093056
arancinopicopicoprobe.menu.flash.2097152_0.build.eeprom_start=270528512
arancinopicopicoprobe.menu.flash.2097152_0.build.fs_start=270528512
arancinopicopicoprobe.menu.flash.2097152_0.build.fs_end=270528512
arancinopicopicoprobe.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
arancinopicopicoprobe.menu.flash.2097152_65536.upload.maximum_size=2027520
arancinopicopicoprobe.menu.flash.2097152_65536.build.flash_length=2027520
arancinopicopicoprobe.menu.flash.2097152_65536.build.eeprom_start=270528512
arancinopicopicoprobe.menu.flash.2097152_65536.build.fs_start=270462976
arancinopicopicoprobe.menu.flash.2097152_65536.build.fs_end=270528512
arancinopicopicoprobe.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
arancinopicopicoprobe.menu.flash.2097152_131072.upload.maximum_size=1961984
arancinopicopicoprobe.menu.flash.2097152_131072.build.flash_length=1961984
arancinopicopicoprobe.menu.flash.2097152_131072.build.eeprom_start=270528512
arancinopicopicoprobe.menu.flash.2097152_131072.build.fs_start=270397440
arancinopicopicoprobe.menu.flash.2097152_131072.build.fs_end=270528512
arancinopicopicoprobe.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
arancinopicopicoprobe.menu.flash.2097152_262144.upload.maximum_size=1830912
arancinopicopicoprobe.menu.flash.2097152_262144.build.flash_length=1830912
arancinopicopicoprobe.menu.flash.2097152_262144.build.eeprom_start=270528512
arancinopicopicoprobe.menu.flash.2097152_262144.build.fs_start=270266368
arancinopicopicoprobe.menu.flash.2097152_262144.build.fs_end=270528512
arancinopicopicoprobe.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
arancinopicopicoprobe.menu.flash.2097152_524288.upload.maximum_size=1568768
arancinopicopicoprobe.menu.flash.2097152_524288.build.flash_length=1568768
arancinopicopicoprobe.menu.flash.2097152_524288.build.eeprom_start=270528512
arancinopicopicoprobe.menu.flash.2097152_524288.build.fs_start=270004224
arancinopicopicoprobe.menu.flash.2097152_524288.build.fs_end=270528512
arancinopicopicoprobe.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
arancinopicopicoprobe.menu.flash.2097152_1048576.upload.maximum_size=1044480
arancinopicopicoprobe.menu.flash.2097152_1048576.build.flash_length=1044480
arancinopicopicoprobe.menu.flash.2097152_1048576.build.eeprom_start=270528512
arancinopicopicoprobe.menu.flash.2097152_1048576.build.fs_start=269479936
arancinopicopicoprobe.menu.flash.2097152_1048576.build.fs_end=270528512
arancinopicopicoprobe.menu.freq.133=133 MHz
arancinopicopicoprobe.menu.freq.133.build.f_cpu=133000000L
arancinopicopicoprobe.menu.freq.50=50 MHz
arancinopicopicoprobe.menu.freq.50.build.f_cpu=50000000L
arancinopicopicoprobe.menu.freq.100=100 MHz
arancinopicopicoprobe.menu.freq.100.build.f_cpu=100000000L
arancinopicopicoprobe.menu.freq.120=120 MHz
arancinopicopicoprobe.menu.freq.120.build.f_cpu=120000000L
arancinopicopicoprobe.menu.freq.125=125 MHz
arancinopicopicoprobe.menu.freq.125.build.f_cpu=125000000L
arancinopicopicoprobe.menu.freq.150=150 MHz (Overclock)
arancinopicopicoprobe.menu.freq.150.build.f_cpu=150000000L
arancinopicopicoprobe.menu.freq.175=175 MHz (Overclock)
arancinopicopicoprobe.menu.freq.175.build.f_cpu=175000000L
arancinopicopicoprobe.menu.freq.200=200 MHz (Overclock)
arancinopicopicoprobe.menu.freq.200.build.f_cpu=200000000L
arancinopicopicoprobe.menu.freq.225=225 MHz (Overclock)
arancinopicopicoprobe.menu.freq.225.build.f_cpu=225000000L
arancinopicopicoprobe.menu.freq.240=240 MHz (Overclock)
arancinopicopicoprobe.menu.freq.240.build.f_cpu=240000000L
arancinopicopicoprobe.menu.freq.250=250 MHz (Overclock)
arancinopicopicoprobe.menu.freq.250.build.f_cpu=250000000L
arancinopicopicoprobe.menu.freq.275=275 MHz (Overclock)
arancinopicopicoprobe.menu.freq.275.build.f_cpu=275000000L
arancinopicopicoprobe.menu.freq.300=300 MHz (Overclock)
arancinopicopicoprobe.menu.freq.300.build.f_cpu=300000000L
arancinopicopicoprobe.menu.opt.Small=Small (-Os) (standard)
arancinopicopicoprobe.menu.opt.Small.build.flags.optimize=-Os
arancinopicopicoprobe.menu.opt.Optimize=Optimize (-O)
arancinopicopicoprobe.menu.opt.Optimize.build.flags.optimize=-O
arancinopicopicoprobe.menu.opt.Optimize2=Optimize More (-O2)
arancinopicopicoprobe.menu.opt.Optimize2.build.flags.optimize=-O2
arancinopicopicoprobe.menu.opt.Optimize3=Optimize Even More (-O3)
arancinopicopicoprobe.menu.opt.Optimize3.build.flags.optimize=-O3
arancinopicopicoprobe.menu.opt.Fast=Fast (-Ofast) (maybe slower)
arancinopicopicoprobe.menu.opt.Fast.build.flags.optimize=-Ofast
arancinopicopicoprobe.menu.opt.Debug=Debug (-Og)
arancinopicopicoprobe.menu.opt.Debug.build.flags.optimize=-Og
arancinopicopicoprobe.menu.rtti.Disabled=Disabled
arancinopicopicoprobe.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
arancinopicopicoprobe.menu.rtti.Enabled=Enabled
arancinopicopicoprobe.menu.rtti.Enabled.build.flags.rtti=
arancinopicopicoprobe.menu.stackprotect.Disabled=Disabled
arancinopicopicoprobe.menu.stackprotect.Disabled.build.flags.stackprotect=
arancinopicopicoprobe.menu.stackprotect.Enabled=Enabled
arancinopicopicoprobe.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
arancinopicopicoprobe.menu.exceptions.Disabled=Disabled
arancinopicopicoprobe.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
arancinopicopicoprobe.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
arancinopicopicoprobe.menu.exceptions.Enabled=Enabled
arancinopicopicoprobe.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
arancinopicopicoprobe.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
arancinopicopicoprobe.menu.dbgport.Disabled=Disabled
arancinopicopicoprobe.menu.dbgport.Disabled.build.debug_port=
arancinopicopicoprobe.menu.dbgport.Serial=Serial
arancinopicopicoprobe.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
arancinopicopicoprobe.menu.dbgport.Serial1=Serial1
arancinopicopicoprobe.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
arancinopicopicoprobe.menu.dbgport.Serial2=Serial2
arancinopicopicoprobe.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
arancinopicopicoprobe.menu.dbglvl.None=None
arancinopicopicoprobe.menu.dbglvl.None.build.debug_level=
arancinopicopicoprobe.menu.dbglvl.Core=Core
arancinopicopicoprobe.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
arancinopicopicoprobe.menu.dbglvl.SPI=SPI
arancinopicopicoprobe.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
arancinopicopicoprobe.menu.dbglvl.Wire=Wire
arancinopicopicoprobe.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
arancinopicopicoprobe.menu.dbglvl.All=All
arancinopicopicoprobe.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
arancinopicopicoprobe.menu.dbglvl.NDEBUG=NDEBUG
arancinopicopicoprobe.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
arancinopicopicoprobe.menu.usbstack.picosdk=Pico SDK
arancinopicopicoprobe.menu.usbstack.picosdk.build.usbstack_flags=
arancinopicopicoprobe.menu.usbstack.tinyusb=Adafruit TinyUSB
arancinopicopicoprobe.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
arancinopicopicoprobe.menu.ipstack.ipv4only=IPv4 Only
arancinopicopicoprobe.menu.ipstack.ipv4only.build.libpico=libpico.a
arancinopicopicoprobe.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
arancinopicopicoprobe.menu.ipstack.ipv4ipv6=IPv4 and IPv6
arancinopicopicoprobe.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
arancinopicopicoprobe.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
arancinopicopicoprobe.menu.freertos.no=No
arancinopicopicoprobe.menu.freertos.yes=Yes
arancinopicopicoprobe.menu.freertos.no.build.arancino_extra_flags=
arancinopicopicoprobe.menu.freertos.yes.build.arancino_extra_flags=-DUSEFREERTOS

