smartmeio/arancino-core-mbed/boards.txt
# -----------------------------------
# SmartMe.io Arancino Pico (pico-debug)
# -----------------------------------
arancinopicopicodebug.name=SmartMe.io Arancino Pico (pico-debug)
arancinopicopicodebug.vid.0=0x1209
arancinopicopicodebug.pid.0=0x2488
arancinopicopicodebug.vid.1=0x1209
arancinopicopicodebug.pid.1=0x2588
arancinopicopicodebug.vid.2=0x1209
arancinopicopicodebug.pid.2=0x6488
arancinopicopicodebug.vid.3=0x1209
arancinopicopicodebug.pid.3=0x6588
arancinopicopicodebug.vid.4=0x1209
arancinopicopicodebug.pid.4=0xa488
arancinopicopicodebug.vid.5=0x1209
arancinopicopicodebug.pid.5=0xa588
arancinopicopicodebug.vid.6=0x1209
arancinopicopicodebug.pid.6=0xe488
arancinopicopicodebug.vid.7=0x1209
arancinopicopicodebug.pid.7=0xe588
arancinopicopicodebug.build.usbpid=-DSERIALUSB_PID=0x000a
arancinopicopicodebug.build.usbpwr=-DUSBD_MAX_POWER_MA=250
arancinopicopicodebug.build.board=ARANCINO_PICO
arancinopicopicodebug.build.mcu=cortex-m0plus
arancinopicopicodebug.build.variant=arancinopico
arancinopicopicodebug.upload.tool=picodebug
arancinopicopicodebug.upload.maximum_size=2097152
arancinopicopicodebug.upload.maximum_data_size=245760
arancinopicopicodebug.upload.wait_for_upload_port=true
arancinopicopicodebug.upload.erase_cmd=
arancinopicopicodebug.serial.disableDTR=false
arancinopicopicodebug.serial.disableRTS=false
arancinopicopicodebug.build.f_cpu=125000000
arancinopicopicodebug.build.led=
arancinopicopicodebug.build.core=rp2040
arancinopicopicodebug.build.ldscript=memmap_default.ld
arancinopicopicodebug.build.ram_length=240k
arancinopicopicodebug.build.boot2=boot2_w25q080_2_padded_checksum
arancinopicopicodebug.build.vid=0x2e8a
arancinopicopicodebug.build.pid=0x000a
arancinopicopicodebug.build.usb_manufacturer="SmartMe.io"
arancinopicopicodebug.build.usb_product="Arancino Pico (pico-debug)"
arancinopicopicodebug.menu.flash.2097152_0=2MB (no FS)
arancinopicopicodebug.menu.flash.2097152_0.upload.maximum_size=2093056
arancinopicopicodebug.menu.flash.2097152_0.build.flash_length=2093056
arancinopicopicodebug.menu.flash.2097152_0.build.eeprom_start=270528512
arancinopicopicodebug.menu.flash.2097152_0.build.fs_start=270528512
arancinopicopicodebug.menu.flash.2097152_0.build.fs_end=270528512
arancinopicopicodebug.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
arancinopicopicodebug.menu.flash.2097152_65536.upload.maximum_size=2027520
arancinopicopicodebug.menu.flash.2097152_65536.build.flash_length=2027520
arancinopicopicodebug.menu.flash.2097152_65536.build.eeprom_start=270528512
arancinopicopicodebug.menu.flash.2097152_65536.build.fs_start=270462976
arancinopicopicodebug.menu.flash.2097152_65536.build.fs_end=270528512
arancinopicopicodebug.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
arancinopicopicodebug.menu.flash.2097152_131072.upload.maximum_size=1961984
arancinopicopicodebug.menu.flash.2097152_131072.build.flash_length=1961984
arancinopicopicodebug.menu.flash.2097152_131072.build.eeprom_start=270528512
arancinopicopicodebug.menu.flash.2097152_131072.build.fs_start=270397440
arancinopicopicodebug.menu.flash.2097152_131072.build.fs_end=270528512
arancinopicopicodebug.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
arancinopicopicodebug.menu.flash.2097152_262144.upload.maximum_size=1830912
arancinopicopicodebug.menu.flash.2097152_262144.build.flash_length=1830912
arancinopicopicodebug.menu.flash.2097152_262144.build.eeprom_start=270528512
arancinopicopicodebug.menu.flash.2097152_262144.build.fs_start=270266368
arancinopicopicodebug.menu.flash.2097152_262144.build.fs_end=270528512
arancinopicopicodebug.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
arancinopicopicodebug.menu.flash.2097152_524288.upload.maximum_size=1568768
arancinopicopicodebug.menu.flash.2097152_524288.build.flash_length=1568768
arancinopicopicodebug.menu.flash.2097152_524288.build.eeprom_start=270528512
arancinopicopicodebug.menu.flash.2097152_524288.build.fs_start=270004224
arancinopicopicodebug.menu.flash.2097152_524288.build.fs_end=270528512
arancinopicopicodebug.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
arancinopicopicodebug.menu.flash.2097152_1048576.upload.maximum_size=1044480
arancinopicopicodebug.menu.flash.2097152_1048576.build.flash_length=1044480
arancinopicopicodebug.menu.flash.2097152_1048576.build.eeprom_start=270528512
arancinopicopicodebug.menu.flash.2097152_1048576.build.fs_start=269479936
arancinopicopicodebug.menu.flash.2097152_1048576.build.fs_end=270528512
arancinopicopicodebug.menu.freq.133=133 MHz
arancinopicopicodebug.menu.freq.133.build.f_cpu=133000000L
arancinopicopicodebug.menu.freq.50=50 MHz
arancinopicopicodebug.menu.freq.50.build.f_cpu=50000000L
arancinopicopicodebug.menu.freq.100=100 MHz
arancinopicopicodebug.menu.freq.100.build.f_cpu=100000000L
arancinopicopicodebug.menu.freq.120=120 MHz
arancinopicopicodebug.menu.freq.120.build.f_cpu=120000000L
arancinopicopicodebug.menu.freq.125=125 MHz
arancinopicopicodebug.menu.freq.125.build.f_cpu=125000000L
arancinopicopicodebug.menu.freq.150=150 MHz (Overclock)
arancinopicopicodebug.menu.freq.150.build.f_cpu=150000000L
arancinopicopicodebug.menu.freq.175=175 MHz (Overclock)
arancinopicopicodebug.menu.freq.175.build.f_cpu=175000000L
arancinopicopicodebug.menu.freq.200=200 MHz (Overclock)
arancinopicopicodebug.menu.freq.200.build.f_cpu=200000000L
arancinopicopicodebug.menu.freq.225=225 MHz (Overclock)
arancinopicopicodebug.menu.freq.225.build.f_cpu=225000000L
arancinopicopicodebug.menu.freq.240=240 MHz (Overclock)
arancinopicopicodebug.menu.freq.240.build.f_cpu=240000000L
arancinopicopicodebug.menu.freq.250=250 MHz (Overclock)
arancinopicopicodebug.menu.freq.250.build.f_cpu=250000000L
arancinopicopicodebug.menu.freq.275=275 MHz (Overclock)
arancinopicopicodebug.menu.freq.275.build.f_cpu=275000000L
arancinopicopicodebug.menu.freq.300=300 MHz (Overclock)
arancinopicopicodebug.menu.freq.300.build.f_cpu=300000000L
arancinopicopicodebug.menu.opt.Small=Small (-Os) (standard)
arancinopicopicodebug.menu.opt.Small.build.flags.optimize=-Os
arancinopicopicodebug.menu.opt.Optimize=Optimize (-O)
arancinopicopicodebug.menu.opt.Optimize.build.flags.optimize=-O
arancinopicopicodebug.menu.opt.Optimize2=Optimize More (-O2)
arancinopicopicodebug.menu.opt.Optimize2.build.flags.optimize=-O2
arancinopicopicodebug.menu.opt.Optimize3=Optimize Even More (-O3)
arancinopicopicodebug.menu.opt.Optimize3.build.flags.optimize=-O3
arancinopicopicodebug.menu.opt.Fast=Fast (-Ofast) (maybe slower)
arancinopicopicodebug.menu.opt.Fast.build.flags.optimize=-Ofast
arancinopicopicodebug.menu.opt.Debug=Debug (-Og)
arancinopicopicodebug.menu.opt.Debug.build.flags.optimize=-Og
arancinopicopicodebug.menu.rtti.Disabled=Disabled
arancinopicopicodebug.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
arancinopicopicodebug.menu.rtti.Enabled=Enabled
arancinopicopicodebug.menu.rtti.Enabled.build.flags.rtti=
arancinopicopicodebug.menu.stackprotect.Disabled=Disabled
arancinopicopicodebug.menu.stackprotect.Disabled.build.flags.stackprotect=
arancinopicopicodebug.menu.stackprotect.Enabled=Enabled
arancinopicopicodebug.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector
arancinopicopicodebug.menu.exceptions.Disabled=Disabled
arancinopicopicodebug.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
arancinopicopicodebug.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
arancinopicopicodebug.menu.exceptions.Enabled=Enabled
arancinopicopicodebug.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
arancinopicopicodebug.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
arancinopicopicodebug.menu.dbgport.Disabled=Disabled
arancinopicopicodebug.menu.dbgport.Disabled.build.debug_port=
arancinopicopicodebug.menu.dbgport.Serial=Serial
arancinopicopicodebug.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
arancinopicopicodebug.menu.dbgport.Serial1=Serial1
arancinopicopicodebug.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
arancinopicopicodebug.menu.dbgport.Serial2=Serial2
arancinopicopicodebug.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
arancinopicopicodebug.menu.dbglvl.None=None
arancinopicopicodebug.menu.dbglvl.None.build.debug_level=
arancinopicopicodebug.menu.dbglvl.Core=Core
arancinopicopicodebug.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
arancinopicopicodebug.menu.dbglvl.SPI=SPI
arancinopicopicodebug.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
arancinopicopicodebug.menu.dbglvl.Wire=Wire
arancinopicopicodebug.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
arancinopicopicodebug.menu.dbglvl.All=All
arancinopicopicodebug.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE
arancinopicopicodebug.menu.dbglvl.NDEBUG=NDEBUG
arancinopicopicodebug.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
arancinopicopicodebug.menu.usbstack.nousb=No USB
arancinopicopicodebug.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
arancinopicopicodebug.menu.ipstack.ipv4only=IPv4 Only
arancinopicopicodebug.menu.ipstack.ipv4only.build.libpico=libpico.a
arancinopicopicodebug.menu.ipstack.ipv4only.build.lwipdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
arancinopicopicodebug.menu.ipstack.ipv4ipv6=IPv4 and IPv6
arancinopicopicodebug.menu.ipstack.ipv4ipv6.build.libpico=libpico-ipv6.a
arancinopicopicodebug.menu.ipstack.ipv4ipv6.build.lwipdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
arancinopicopicodebug.menu.freertos.no=No
arancinopicopicodebug.menu.freertos.yes=Yes
arancinopicopicodebug.menu.freertos.no.build.arancino_extra_flags=
arancinopicopicodebug.menu.freertos.yes.build.arancino_extra_flags=-DUSEFREERTOS
